:PROPERTIES:
:ID:       1fabee0f-edb5-409d-a380-841d07417625
:END:
#+title: Programming a STM32F401


** Programming a STM32F401                :@project:@c:@computerEngineering:

*** looking into the basics
:LOGBOOK:
CLOCK: [2026-02-01 Sun 19:21]--[2026-02-01 Sun 19:25] =>  0:04
CLOCK: [2026-02-01 Sun 18:50]--[2026-02-01 Sun 18:58] =>  0:08
:END:

*** setting up emacs for develpoment
:LOGBOOK:
CLOCK: [2026-02-01 Sun 18:58]--[2026-02-01 Sun 19:20] =>  0:22
:END:


*** playing around with breadboard
:LOGBOOK:
CLOCK: [2026-02-04 Wed 15:40]--[2026-02-04 Wed 16:40] =>  1:00
:END:

*** setting up STM32
:LOGBOOK:
CLOCK: [2026-02-04 Wed 21:30]--[2026-02-04 Wed 22:51] =>  1:21
CLOCK: [2026-02-04 Wed 17:26]--[2026-02-04 Wed 19:26] =>  2:00
:END:

*** setting up stm32cubeide
:LOGBOOK:
CLOCK: [2026-02-13 Fri 15:20]--[2026-02-13 Fri 16:47] =>  1:27
:END:
